app/views/users/show.html.erb

  <li class='active'><a data-toggle="tab" href="#Posts">Posts (<%= @user.posts.size %>)</a></li>
  <li><a data-toggle="tab" href="#Comments">Comments  (<%= @user.comments.size %>)</a></li>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 3]]