app/views/posts/_form.html.erb

  <br/>
  <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"