app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
      <span>
        <%= link_to(pluralize(post.comments.length, "comment"), post_path(post)) %>