app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    @comment.save ? (redirect_to post_path(@post)) : (render 'posts/show' )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Well, it's really a so-so post..."], ["created_at", Sat, 29 Aug 2015 17:59:59 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 29 Aug 2015 17:59:59 UTC +00:00], ["user_id", 3]]