app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    @post.save ? (redirect_to post_path(@post)) : (render :new)
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @post.update(post_params) ? (redirect_to posts_path) : (render :edit)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["description", "Third Guy's test post.\r\nTesting Editing."], ["updated_at", Sat, 29 Aug 2015 18:40:19 UTC +00:00]]